{
  "cells": [
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "Z-FqvRtL5YUF"
      },
      "source": [
        "# Модуль 2 часть 2"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "jz7RHRpY5YUH"
      },
      "source": [
        "## Задача 1\n",
        "\n",
        "**Описание**: Пользователь хочет сохранить список координат. Сначала пользователь вводит число координат, которые у него есть. Далее пользователь поочередно вводит координаты в формате 'x, y'. Выведите на печать список со всеми координатами.\n",
        "\n",
        "**Задание**: Исправьте нижеуказанный код, чтобы он выполнялся без ошибок\n",
        "\n",
        "**Пример данных для проверки**:\n",
        "\n",
        "```\n",
        "Input: 3\n",
        "Input: 10, 10\n",
        "Input: 20, 20\n",
        "Input: 30, 30\n",
        "Output: [(10, 10), (20, 20), (30, 30)]\n",
        "```"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "iJ42443e5YUI"
      },
      "outputs": [],
      "source": [
        "coords_number = input(\"Укажите количество координат:\")\n",
        "\n",
        "coords = tuple()\n",
        "for x in range(coords_number):\n",
        "    user_input = input(\"Введите координату:\")\n",
        "    x, y = user_input.split()\n",
        "    coords.append([x, y])\n",
        "\n",
        "print(coords)"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "MksHt6WX5YUI"
      },
      "source": [
        "## Задача 2\n",
        "\n",
        "**Описание**: Пользователь хочет получить список значений долготы от -180 до 180 с заданным шагом. Шаг пользователь вводит с клавиатуры. Выведите на печать требуемый список значений\n",
        "\n",
        "**Задание**: Самостоятельно напишите код, чтобы он соответствовал описанию\n",
        "\n",
        "**Пример данных для проверки**:\n",
        "\n",
        "```\n",
        "Input: 60\n",
        "Output: [-180, -120, -60, 0, 60, 120, 180]\n",
        "```\n",
        "```\n",
        "Input: 100\n",
        "Output: [-180, -80, 20, 120]\n",
        "```"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "4y9nIlw25YUJ"
      },
      "outputs": [],
      "source": [
        "..."
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "UEwnAhXT5YUJ"
      },
      "source": [
        "## Задача 3\n",
        "\n",
        "**Описание**: Пользователь хочет сгенерировать сетку регулярных точек, расстояние между, которыми будет задано шагом. Сетка должна быть определена в границах -180:180 по долготе и -90:90 по широте. Шаг пользователь вводит с клавиатуры. Выведите на печать список всех точек регулярной сетки.\n",
        "\n",
        "**Задание**: Самостоятельно напишите код, чтобы он соответствовал описанию\n",
        "\n",
        "**Пример данных для проверки**:\n",
        "\n",
        "```\n",
        "Input: 100\n",
        "Output: [(-180, -90), (-80, -90), (20, -90), (120, -90), (-180, 10), (-80, 10), (20, 10), (120, 10)]\n",
        "```\n",
        "```\n",
        "Input: 200\n",
        "Output: [(-180, -90), (20, -90)]\n",
        "```"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "sVu3GmVH5YUJ"
      },
      "outputs": [],
      "source": [
        "..."
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "-o4XpROP5YUJ"
      },
      "source": [
        "## Задача 4\n",
        "\n",
        "**Описание**: Пользователь одновременно отслеживает несколько GPS треков. Сначала пользователь указывает, какое количество измерений он получил. Далее пользователь вводит данные в формате '№трека, x, y'. Номера треков могут повторяться и идти не по порядку. На выходе нужно напечатать словарь, где в качестве ключей будут храниться номера треков, а в качестве значений будут списки соответсвующих им координат.\n",
        "\n",
        "**Задание**: Самостоятельно напишите код, чтобы он соответствовал описанию\n",
        "\n",
        "**Пример данных для проверки**:\n",
        "\n",
        "```\n",
        "Input: 5\n",
        "Input: 1, 10, 10\n",
        "Input: 1, 20, 20\n",
        "Input: 2, 10, 10\n",
        "Input: 1, 30, 30\n",
        "Input: 2, 0, 0\n",
        "Output: {1: [(10, 10), (20, 20), (30, 30)], 2: [(10, 10), (0, 0)]}\n",
        "```"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "Ejx9yOAz5YUJ"
      },
      "outputs": [],
      "source": [
        "..."
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "zjj-ZG425YUJ"
      },
      "source": [
        "## Задача 5\n",
        "\n",
        "**Описание**: Пользователь одновременно отслеживает несколько GPS треков. Сначала пользователь указывает, какое количество измерений он получил. Далее пользователь вводит данные в формате '№трека, x, y'. Номера треков могут повторяться и идти не по порядку. На выходе нужно напечатать расстояния, которые прошел каждый трек.\n",
        "\n",
        "**Задание**: Самостоятельно напишите код, чтобы он соответствовал описанию\n",
        "\n",
        "**Пример данных для проверки**:\n",
        "\n",
        "```\n",
        "Input: 5\n",
        "Input: 1, 10, 10\n",
        "Input: 1, 10, 30\n",
        "Input: 2, 0, 10\n",
        "Input: 1, 40, 30\n",
        "Input: 2, 0, 0\n",
        "Output:\n",
        "1 50\n",
        "2 10\n",
        "```"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "hU6jhqsL5YUK"
      },
      "outputs": [],
      "source": [
        "..."
      ]
    }
  ],
  "metadata": {
    "language_info": {
      "name": "python"
    },
    "colab": {
      "provenance": []
    }
  },
  "nbformat": 4,
  "nbformat_minor": 0
}